Repository: AdysTech/CredentialManager
Catalog: src/shakeyourbunny.CredentialManager/Resources/Strings.*.resx
Languages: de, fr

# CommentTooLong
source: Comment cannot be more than 256 bytes long
de: Kommentar darf nicht mehr als 256 Bytes lang sein
fr: Le commentaire ne peut pas dépasser 256 octets

# TargetNameNullOrEmpty
source: TargetName cannot be null or empty
de: TargetName darf nicht null oder leer sein
fr: TargetName ne peut pas être nul ou vide

# TargetNameTooLong
source: TargetName cannot be more than 32 kB
de: TargetName darf nicht mehr als 32 kB lang sein
fr: TargetName ne peut pas dépasser 32 ko

# CredentialBlobNullOrEmpty
source: CredentialBlob cannot be null or empty
de: CredentialBlob darf nicht null oder leer sein
fr: CredentialBlob ne peut pas être nul ou vide

# CredentialBlobTooLong
source: Credential cannot be more than {0} bytes long
de: Anmeldedaten dürfen nicht mehr als {0} Bytes lang sein
fr: Les informations d'identification ne peuvent pas dépasser {0} octets

# TooManyAttributes
source: Credentials cannot have more than 64 attributes
de: Anmeldedaten dürfen nicht mehr als 64 Attribute haben
fr: Les informations d'identification ne peuvent pas avoir plus de 64 attributs

# AttributeNameTooLong
source: Attribute names cannot be more than 256 bytes long. Error with key: {0}
de: Attributnamen dürfen nicht mehr als 256 Bytes lang sein. Fehler bei Schlüssel: {0}
fr: Les noms d'attribut ne peuvent pas dépasser 256 octets. Erreur avec la clé : {0}

# AttributeValueNull
source: Attribute value cannot be null. Error with key: {0}
de: Attributwert darf nicht null sein. Fehler bei Schlüssel: {0}
fr: La valeur de l'attribut ne peut pas être nulle. Erreur avec la clé : {0}

# AttributeValueTooLong
source: Attribute values cannot be more than 256 bytes long after serialization. Error with value for key: {0}
de: Attributwerte dürfen nach der Serialisierung nicht mehr als 256 Bytes lang sein. Fehler bei Wert für Schlüssel: {0}
fr: Les valeurs d'attribut ne peuvent pas dépasser 256 octets après sérialisation. Erreur avec la valeur pour la clé : {0}

source: Unable to save credential
de: Anmeldedaten konnten nicht gespeichert werden
fr: Impossible d'enregistrer les informations d'identification

source: Unable to parse user name
de: Benutzername konnte nicht analysiert werden
fr: Impossible d'analyser le nom d'utilisateur

source: Unable to delete credential
de: Anmeldedaten konnten nicht gelöscht werden
fr: Impossible de supprimer les informations d'identification

# UnableToEnumerateCredentials
source: Unable to enumerate credential store
de: Anmeldedatenspeicher konnte nicht aufgelistet werden
fr: Impossible d'énumérer le magasin d'informations d'identification

source: Unable to read credential
de: Anmeldedaten konnten nicht gelesen werden
fr: Impossible de lire les informations d'identification

source: Invalid CriticalHandle!
de: Ungültiges CriticalHandle!
fr: CriticalHandle non valide !
